In [23]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.cluster import DBSCAN
from sklearn import  metrics

In [2]:
data = pd.read_csv("/content/Mall_Customers.csv")
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [3]:
data.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [4]:
x = data.drop(['Annual Income (k$)','Spending Score (1-100)'],axis=1)

In [5]:
x

     CustomerID  Gender  Age
0             1    Male   19
1             2    Male   21
2             3  Female   20
3             4  Female   23
4             5  Female   31
..          ...     ...  ...
195         196  Female   35
196         197  Female   45
197         198    Male   32
198         199    Male   32
199         200    Male   30

[200 rows x 3 columns]

In [6]:
x = x.drop('CustomerID',axis=1)

In [7]:
x

     Gender  Age
0      Male   19
1      Male   21
2    Female   20
3    Female   23
4    Female   31
..      ...  ...
195  Female   35
196  Female   45
197    Male   32
198    Male   32
199    Male   30

[200 rows x 2 columns]

In [8]:
x['Gender'] = pd.Categorical(x['Gender'])
x['Gender'] = x['Gender'].cat.codes

In [9]:
x

     Gender  Age
0         1   19
1         1   21
2         0   20
3         0   23
4         0   31
..      ...  ...
195       0   35
196       0   45
197       1   32
198       1   32
199       1   30

[200 rows x 2 columns]

In [10]:
db = DBSCAN(eps=1,min_samples=5,metric='euclidean')

In [16]:
model = db.fit(x)

In [17]:
label = model.labels_

In [18]:
sample_cores = np.zeros_like(label,dtype=bool)

In [19]:
sample_cores[db.core_sample_indices_]=True

In [20]:
number_of_cluster = len(set(label))- (1 if -1 in label else 0)

In [22]:
number_of_cluster

4

In [24]:
metrics.silhouette_score(x,label)

0.342515396035987